org/indemind-guide.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>indemind-guide</title>
<!-- 2020-09-25 Ба 12:06 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="indemind" />
</head>
<body>
<div id="content">
<h1 class="title">indemind-guide</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 服务维护</a>
<ul>
<li><a href="#sec-1-1">1.1. 注意事项</a></li>
<li><a href="#sec-1-2">1.2. 个人pc</a></li>
<li><a href="#sec-1-3">1.3. gitlab代码服务器</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1. 基本信息</a></li>
<li><a href="#sec-1-3-2">1.3.2. gitlab服务</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4. 主服务器(191)</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1. 基本信息</a></li>
<li><a href="#sec-1-4-2">1.4.2. jira服务</a></li>
<li><a href="#sec-1-4-3">1.4.3. confluence服务</a></li>
<li><a href="#sec-1-4-4">1.4.4. ftp服务</a></li>
<li><a href="#sec-1-4-5">1.4.5. mysql服务</a></li>
<li><a href="#sec-1-4-6">1.4.6. jenkins服务</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5. TX2服务器</a></li>
<li><a href="#sec-1-6">1.6. 电力服务器(外网)</a></li>
<li><a href="#sec-1-7">1.7. 移动处理器</a></li>
<li><a href="#sec-1-8">1.8. 服务器备份策略</a>
<ul>
<li><a href="#sec-1-8-1">1.8.1. jira备份</a></li>
<li><a href="#sec-1-8-2">1.8.2. confluence备份</a></li>
<li><a href="#sec-1-8-3">1.8.3. gitlab备份</a></li>
</ul>
</li>
<li><a href="#sec-1-9">1.9. slam编译文档</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 服务维护</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 注意事项</h3>
<div class="outline-text-3" id="text-1-1">
<p>
所有服务已设定开机自启动,如需重启请参考如下
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 个人pc</h3>
<div class="outline-text-3" id="text-1-2">
<p>
ip: 192.168.50.206
</p>

<p>
账号密码: indemind/indemind
</p>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> gitlab代码服务器</h3>
<div class="outline-text-3" id="text-1-3">
</div><div id="outline-container-sec-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> 基本信息</h4>
<div class="outline-text-4" id="text-1-3-1">
<p>
服务器地址: 192.168.50.158    
</p>

<p>
终端账户密码: indemind/indemind root/root@indemind
</p>

<p>
gitlab服务账号密码: qishanqing/qsq372233
</p>
</div>
</div>
<div id="outline-container-sec-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> gitlab服务</h4>
<div class="outline-text-4" id="text-1-3-2">
<p>
启动命令: gitlab-ctl start
</p>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 主服务器(191)</h3>
<div class="outline-text-3" id="text-1-4">
</div><div id="outline-container-sec-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> 基本信息</h4>
<div class="outline-text-4" id="text-1-4-1">
<p>
服务器地址: 192.168.50.191
</p>

<p>
账户: indemind
</p>

<p>
密码: 372233
</p>
</div>
</div>
<div id="outline-container-sec-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> jira服务</h4>
<div class="outline-text-4" id="text-1-4-2">
<p>
启动命令: docker start jira7
</p>

<p>
访问链接: <a href="http://192.168.50.191:8722">http://192.168.50.191:8722</a>
</p>

<p>
培训文档: <a href="http://192.168.50.191:8090/x/NAAF">http://192.168.50.191:8090/x/NAAF</a>
</p>

<p>
管理员权限账号: qishanqing/qsq372233
</p>
</div>
</div>
<div id="outline-container-sec-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> confluence服务</h4>
<div class="outline-text-4" id="text-1-4-3">
<p>
启动命令: docker start confluence
</p>

<p>
访问链接: <a href="http://192.168.50.191:8090">http://192.168.50.191:8090</a>
</p>

<p>
培训文档: <a href="http://192.168.50.191:8090/x/AoAs">http://192.168.50.191:8090/x/AoAs</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> ftp服务</h4>
<div class="outline-text-4" id="text-1-4-4">
<p>
启动命令: docker start ftp
</p>

<p>
服务挂载宿主机数据地址: /docker/ftp
</p>

<p>
已创建账号密码: ftpuser/ftpuser@indemind  guest/guest
</p>

<p>
挂载命令:sudo curlftpfs 192.168.50.191 <i>mnt/ftp</i> -o user=ftpuser:ftpuser@indemind -o allow<sub>other</sub>
</p>
</div>
</div>
<div id="outline-container-sec-1-4-5" class="outline-4">
<h4 id="sec-1-4-5"><span class="section-number-4">1.4.5</span> mysql服务</h4>
<div class="outline-text-4" id="text-1-4-5">
</div><ol class="org-ol"><li><a id="sec-1-4-5-1" name="sec-1-4-5-1"></a>jira服务连接<br  /><div class="outline-text-5" id="text-1-4-5-1">
<p>
docker mysql服务 (host=192.168.50.191)(port=8720) 数据库-&gt;jira7
</p>

<p>
服务挂载宿主机数据地址: /docker/mysqletc/data
</p>

<p>
账号密码: jira/jira
</p>
</div>
</li>
<li><a id="sec-1-4-5-2" name="sec-1-4-5-2"></a>confluence服务<br  /><div class="outline-text-5" id="text-1-4-5-2">
<p>
mysql本地服务端口 3306 数据库-&gt;confluence
</p>

<p>
账号密码: root/123
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-4-6" class="outline-4">
<h4 id="sec-1-4-6"><span class="section-number-4">1.4.6</span> jenkins服务</h4>
<div class="outline-text-4" id="text-1-4-6">
<p>
启动命令: systemctl start jenkins
</p>

<p>
管理员权限账号密码: qishanqing/qsq372233
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> TX2服务器</h3>
<div class="outline-text-3" id="text-1-5">
<p>
服务器地址: 192.168.50.101
</p>

<p>
账号密码: nvidia/nvidia
</p>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 电力服务器(外网)</h3>
<div class="outline-text-3" id="text-1-6">
<p>
服务器地址: 59.111.94.255
</p>

<p>
连接方式: ssh -i yunduan.pam root@59.111.94.255(191服务器indmeind账户
.ssh下使用秘钥yunduan.pam)
</p>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 移动处理器</h3>
<div class="outline-text-3" id="text-1-7">
<p>
处理器信息链接: <a href="http://192.168.50.191:8090/x/AYCB">http://192.168.50.191:8090/x/AYCB</a>
</p>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> 服务器备份策略</h3>
<div class="outline-text-3" id="text-1-8">
</div><div id="outline-container-sec-1-8-1" class="outline-4">
<h4 id="sec-1-8-1"><span class="section-number-4">1.8.1</span> jira备份</h4>
<div class="outline-text-4" id="text-1-8-1">
</div><ol class="org-ol"><li><a id="sec-1-8-1-1" name="sec-1-8-1-1"></a>文件备份<br  /><div class="outline-text-5" id="text-1-8-1-1">
<p>
每天凌晨两点多随机
</p>

<p>
备份路径:/backup/jira/export (gitlab服务器挂载盘)
</p>

<p>
执行程序jenkins job: <a href="http://192.168.50.191:8080/view/scm/job/jira-backup/">http://192.168.50.191:8080/view/scm/job/jira-backup/</a>
</p>
</div>
</li>
<li><a id="sec-1-8-1-2" name="sec-1-8-1-2"></a>数据库备份<br  /><div class="outline-text-5" id="text-1-8-1-2">
<p>
每天凌晨两点多随机
</p>

<p>
备份路径:/backup/jira/mysql (gitlab服务器挂载盘)
</p>

<p>
执行程序jenkins job: <a href="http://192.168.50.191:8080/view/scm/job/jira-backup/">http://192.168.50.191:8080/view/scm/job/jira-backup/</a>
</p>
</div>
</li></ol>
</div>

<div id="outline-container-sec-1-8-2" class="outline-4">
<h4 id="sec-1-8-2"><span class="section-number-4">1.8.2</span> confluence备份</h4>
<div class="outline-text-4" id="text-1-8-2">
</div><ol class="org-ol"><li><a id="sec-1-8-2-1" name="sec-1-8-2-1"></a>文件备份<br  /><div class="outline-text-5" id="text-1-8-2-1">
<p>
每周3凌晨两点多随机
</p>

<p>
备份路径:/backup/confluence/backups (gitlab服务器挂载盘)
</p>

<p>
执行程序jenkins job: <a href="http://192.168.50.191:8080/view/scm/job/confluence-backup/">http://192.168.50.191:8080/view/scm/job/confluence-backup/</a>
</p>
</div>
</li>
<li><a id="sec-1-8-2-2" name="sec-1-8-2-2"></a>数据库备份<br  /><div class="outline-text-5" id="text-1-8-2-2">
<p>
每周3凌晨两点多随机
</p>

<p>
备份路径:/backup/confluence/mysql (gitlab服务器挂载盘)
</p>

<p>
执行程序jenkins job: <a href="http://192.168.50.191:8080/view/scm/job/confluence-backup/">http://192.168.50.191:8080/view/scm/job/confluence-backup/</a>
</p>
</div>
</li></ol>
</div>
<div id="outline-container-sec-1-8-3" class="outline-4">
<h4 id="sec-1-8-3"><span class="section-number-4">1.8.3</span> gitlab备份</h4>
<div class="outline-text-4" id="text-1-8-3">
<p>
每天凌晨一点,gitlab系统自带备份策略
</p>

<p>
备份路径:/backup/gitlab/backups (gitlab服务器挂载盘)
</p>

<p>
执行程序cron
</p>
</div>
</div>
</div>

<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> slam编译文档</h3>
<div class="outline-text-3" id="text-1-9">
<p>
文档链接: <a href="http://192.168.50.206/org/slam_compile.html">http://192.168.50.206/org/slam_compile.html</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: indemind</p>
<p class="date">Created: 2020-09-25 Ба 12:06</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
